{
  "blogs": [
    {
      "title": "aladin",
      "body": "Aladin, le fils du tailleur, n'en croit pas ses oreilles, un mystérieux oncle revenu d'Afrique lui offre de devenir marchand d'étoffes. En échange Aladin devra s'aventurer dans les profondeurs d'un souterrain pour lui en rapporter une lampe magique. Un des contes du recueil«Les Mille et une nuits",
      "author": "Rodrigue",
      "id": 1
    },
    {
      "title": "les origines du prenom RODRIGUE",
      "body": "Origine\nLe prénom Rodrigue est un dérivé du prénom germanique Hrodric.\n\nTrouver un autre prénom allemand\n\nAutres origines pour le prénom Rodrigue :\nPrénom français\nQuelle est la signification du prénom Rodrigue ?\nLe prénom ancien Hrodric qui a donné Rodrigue est composé des éléments hrod- et -ric qui signifient respectivement \"gloire\" et \"puissance\".\n\nSaint Rodrigue et date de fête\nLe 13 mars, on honore saint Rodrigue, un prêtre de Cordoue qui fut accusé d'apostasie et décapité au milieu du IXe siècle.\n\nHistoire\nInventé par les Espagnols à partir du prénom germanique Rodéric, le prénom Rodrigue s'est rapidement implanté dans les cultures hispanophones. C'est sans doute grâce à la fabuleuse renommée d'un certain Rodrigue de Bivar, devenu un véritable héros après sa victoire sur les Maures, que ce prénom connut la consécration dans la péninsule ibérique. Ce même Rodrigue, ayant inspiré à Corneille le héros du \"Cid\", contribua, avec le succès de la pièce, à accentuer la popularité de ce prénom. Rodrigue s'est diffusé aussi en Amérique latine, mais il est demeuré discret sous nos cieux jusqu'à ce jour. On estime actuellement à près de 7100 le nombre de Français ayant été prénommés ainsi depuis le début du XXe siècle.\n\nCaractère des Rodrigue\nD'apparence calme, voire froide, Rodrigue dissimule une véritable effervescence en lui. Très sentimental, il ne laisse rien paraître de ses émotions. Un brin opiniâtre, Rodrigue est très attaché à ses convictions sans pour autant fuir les débats. L'ascension professionnelle est importante à ses yeux, mais son engagement familial l'est encore plus. Rodrigue sera sur tous les fronts et ne laissera pas ses ambitions empiéter sur l'harmonie de son foyer.\n\nRodrigue célèbres\nLe prénom Rodrigue est illustré par un bon nombre de personnalités. On citera par exemple les Français Rodrigue Beaubois (footballeur), Rodrigue Moulin et Rodrigue Mels (joueurs de basket-ball) ainsi que Rodrigue Janois, connu en tant que Rod Janois (chanteur et compositeur). Évoquons aussi les Canadiens Rodrigue Jean (réalisateur), Rodrigue Proteau (comédien), Rodrigue Larue (écrivain) et Rodrigue Tremblay (économiste). Il y a également l'Espagnol Rodrigue de Castille (premier comte de Castille) ou encore le Gabonais Rodrigue Moundounga (footballeur).\n\nPrénoms proches\nRodriguez, Rodrigo, Rodric, Rodrick, Roderick, Romarik, Romarick\n\nRodrigue en chiffres\nPopularité actuelle :Prénom rare\nPopularité depuis 1900 :Prénom rare\nTendance actuelle :Prénom en déclin\nMeilleure année :1981 (306 naissances de Rodrigue)\nNaissances en 2020 :9 garçons ont reçu le prénom Rodrigue\nNaissances depuis 1900 :7 944 garçons ont reçu le prénom Rodrigue\nAge moyen des Rodrigue :37 ans",
      "author": "Rodrigue",
      "id": 2
    }
  ]
}